app/views/movements/_form.html.erb

    <select name="movement[movement_id]" class="form-control">
    <%= options_from_collection_for_select(Movement.all, :id, :movement) %>
---
SELECT "movements".* FROM "movements"