app/views/workouts/index.html.erb

<% @workouts.each do |workout| %>
  <% workout.users.each do |u| %>
---
SELECT "users".* FROM "users" INNER JOIN "users_workouts" ON "users"."id" = "users_workouts"."user_id" WHERE "users_workouts"."workout_id" = $1  [["workout_id", 8]]