app/views/users/index.html.erb

<% @user.each do |user| %>
  <% user.workouts.each do |w| %>
      <% w.movements.each do |m| %>
---
SELECT "workouts".* FROM "workouts" INNER JOIN "users_workouts" ON "workouts"."id" = "users_workouts"."workout_id" WHERE "users_workouts"."user_id" = $1  [["user_id", 1]]
SELECT "movements".* FROM "movements" INNER JOIN "workouts" ON "movements"."workout_id" = "workouts"."id" INNER JOIN "users_workouts" ON "workouts"."id" = "users_workouts"."workout_id" WHERE "users_workouts"."user_id" = $1  [["user_id", 1]]