app/views/users/index.html.erb

SELECT SUM("movements"."reps") FROM "movements" INNER JOIN "workouts" ON "movements"."workout_id" = "workouts"."id" INNER JOIN "users_workouts" ON "workouts"."id" = "users_workouts"."workout_id" WHERE "users_workouts"."user_id" = $1  [["user_id", 1]]
---
      <% @user.each do |user| %>
      <td> <%= user.movements.sum("reps") %> </td>