app/views/users/show.html.erb

<div class="workout_container">
  <% @user.workouts.each do |w| %>
---
SELECT "workouts".* FROM "workouts" INNER JOIN "users_workouts" ON "workouts"."id" = "users_workouts"."workout_id" WHERE "users_workouts"."user_id" = $1  [["user_id", 1]]