app/controllers/movements_controller.rb

  def create
    @workout = Workout.find(params[:workout_id])
    @movement = Movement.find(params[:movement][:movement_id])
    @workout.movements.push(@movement)
---
SELECT  "movements".* FROM "movements" WHERE "movements"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "movements" SET "workout_id" = $1, "updated_at" = $2 WHERE "movements"."id" = $3  [["workout_id", 2], ["updated_at", "2015-11-06 20:19:57.855568"], ["id", 2]]