app/controllers/movements_controller.rb

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "movements" ("movement", "reps", "workout_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["movement", "pushups "], ["reps", 10], ["workout_id", 1], ["created_at", "2015-11-05 22:12:48.679668"], ["updated_at", "2015-11-05 22:12:48.679668"]]
---
  def create
    @workout = Workout.find(params[:workout_id])
    @movement = @workout.movements.create(params[:movement].permit(:movement, :reps))

SELECT  "movements".* FROM "movements" WHERE "movements"."id" = $1 LIMIT 1  [["id", nil]]
---
  def destroy
    @movement = Movement.find(params[:id])