app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts"  ORDER BY Created_at DESC
---
  def index
    @workouts = Workout.all.order("Created_at DESC")

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @workout = Workout.find(params[:id])

INSERT INTO "workouts" ("workout", "notes", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    if @workout = Workout.new(workout_params)
    @workout.save

UPDATE "workouts" SET "workout" = $1, "updated_at" = $2 WHERE "workouts"."id" = $3  [["workout", "   RX 3 RFT. 10 Push ups. 10 Situps. 10 Air Squats \r\n   SCALED 3RFT. 10 Assited Pushups. 10 Crunches. 10 Air Squats "], ["updated_at", "2015-11-05 21:30:14.899036"], ["id", 1]]
---
  def update
    if @workout.update(workout_params)

DELETE FROM "workouts" WHERE "workouts"."id" = $1  [["id", 1]]
---
  def destroy
    @workout.destroy

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT 1  [["id", nil]]
---
  def find_workout
      @workout = Workout.find(params[:id])