one_hundred-/app/views/movements/_form.html.erb

    <select class="form-control">
      <option> <%= options_from_collection_for_select(Movement.all, :movement, :movement) %> </option>
---
SELECT "movements".* FROM "movements"